app/controllers/messages_controller.rb

DELETE FROM "messages" WHERE "id" = 1
---
  def destroy
    unauthorized! if cannot? :destroy, Message
    @message.destroy