app/controllers/messages_controller.rb

SELECT * FROM "messages" WHERE ("messages".messageable_id = 3 AND "messages".messageable_type = 'User')
---
  def index
	@mailbox = params[:mailbox]
	if @mailbox == "sent"
     		 @messages = @current_user.messages_as_author.find(:all)

SELECT * FROM "messages" WHERE ("messages"."id" = 3)
---
  def show
    @message = Message.find(params[:id])

INSERT INTO "messages" ("created_at", "title", "updated_at", "messageable_type", "messageable_id", "content", "author_id") VALUES('2010-03-20 18:01:38', NULL, '2010-03-20 18:01:38', NULL, NULL, NULL, 3)
---
  def create

     @message = @current_user.messages_as_author.build(params[:message])
     if @message.save