app/controllers/sessions_controller.rb

SELECT * FROM "users"
SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def create
	@password = params[:password]
	@login = params[:login]
	@users = User.all
		@users.each do |user|
			if user.login.downcase == @login.downcase && user.password.downcase == @password.downcase
				session[:id] = user.id
				flash[:notice] = "Welcome, #{User.find(session[:id]).name}!"