app/controllers/users_controller.rb

  def create
	@user = User.new(params[:user])
	if @user.save
---
INSERT INTO "users" ("name", "created_at", "crypted_password", "updated_at", "password_salt", "persistence_token", "login") VALUES('Sasha Belozerov', '2010-03-18 10:49:40', '559e2be451856fef7822a26ef1db2123bfacbe5004e1cbaa0822235bf55dbbe1929e2e14ae6e2a73ec87e064928d0ab9e55b3f9443d64f27fa271fdb3a771949', '2010-03-18 10:49:40', 'jfcwJ1aFSLO0Hq618wrW', 'f28c8ba56a9d869ed52c7037fa399dbb2db03a894b42c9f3e4f101b08e1bd732b065df41ab29eb6af2ded581ca209123b107a3c6702bfbafba99d85c055454c3', 'ab22')

  def destroy
    @current_user.destroy
---
DELETE FROM "users" WHERE "id" = 1